{
  "translations": {
    "pre-issuance-guide": {
      "guide": "After the asset creation stage, actual tokens already exist, but no one yet owns them — they are all locked up on a smart contract. Pre-issuance is either done automatically or manually.\r\n\r\n*Automatic pre-issuance* means that a certain number of tokens, which were specified during the token creation, will be pre-issued immediately after one of the admins approves the token creation request.\r\n\r\n*Manual pre-issuance* means that a user creates a pre-issuance file via an offline application, uploads it on the platform and waits for an admin approval (more detail in offline application).\r\n\r\nOffline application is an instrument which allows increasing the level of security during the token pre-issuance as well as provides for the diversification of risks.\r\n\r\nIn a direct sense, an offline application is a separate software you download to your device to perform operations related to the token pre-issuance. It is available for both users and admins.\r\n\r\nUsing an offline application, token pre-issuance can be split into two stages both performed by different parties: one uses an offline application to generate the pre-issuance file and sign it with their keys, another uploads this file to the platform so that actual tokens are pre-issued. In this way, the risk of unauthorized token issuance on the platform is diversified due to the correct allocation of duties.\r\n\r\nOffline application includes the following functionality:\r\n  - [Pre-issue tokens](#pre-issue-tokens)\r\n  - [Generate a new key pair](#generate-a-new-key-pair)\r\n  - [Change asset issuer](#change-asset-issuer)\r\n \r\n#### <a name=\"pre-issue-tokens\">Pre-issue tokens<\/a>\r\n![pre-issue-tokens](static\/images\/pre-issuance-guide\/pre-issue-tokens.png)\r\nThis process means that a user\/admin creates a pre-issuance file, where they specify the pre-issuance details (which token, how much to pre-issue). This file contains a transaction for pre-issuance, which, before being sent, has to be signed by the creator of the file and also by another party that uploads this file to the platform (these actually could be one person, but to increase the security and diversify the risks, it is recommended to allocate the pre-issuance process into two stages).\r\n\r\n#### <a name=\"generate-a-new-key-pair\">Generate a new key pair<\/a>\r\n![generate-new-keypair](static\/images\/pre-issuance-guide\/generate-new-keypair.png)\r\nFor higher security, it is assumed that the keys that will be later used for the tokens pre-issuance are generated in an offline application. This is done to have higher confidence that they haven’t been exposed by hackers during the generation.\r\n\r\n#### <a name=\"change-asset-issuer\">Change asset issuer<\/a>\r\n![change-asset-issuer](static\/images\/pre-issuance-guide\/change-asset-issuer.png)\r\nOne example when this might be needed is when one of the parties responsible for pre-issuance had been fired from your organization, and you have to make sure that their key can no longer be used for signing the transaction for pre-issuance.\r\n\r\n| Field | Description | Example of value |\r\n| ----------- | ----------- | ----------- |\r\n| Asset | Asset's code to pre-issue | TTK |\r\n| New issuer public key | New party's account id who responsible for pre-issuance | GCYS3XJESJDBBGDXELT4SMAZHCMCUC4GCWLGQSJZTBSCNMASMTUІ2ILE |\r\n| Transaction source | Account id of asset owner | GCTIXLAYUG7PJU7RJKEQJKCMDSLTNWW46SYE72VPUNDH54Y4I3EB3OLJ |\r\n| Network passphrase | A sequence of words or other text used to control access to a system | Alice Wonderland Network |\r\n\r\n#### Where to get these values?\r\nGo to the **Settings** page\r\n\r\n##### To view Account ID, press *view Account ID*\r\n<span class=\"pre-issuance-guide__img-wrapper\">![account-id](static\/images\/pre-issuance-guide\/settings-account-id-row.png)![account-id](static\/images\/pre-issuance-guide\/settings-account-id-form.png)\r\n<\/span>\r\n\r\n##### To view Network passphrase, press *view network passphrase*\r\n<span class=\"pre-issuance-guide__img-wrapper\">![account-id](static\/images\/pre-issuance-guide\/settings-network-passphrase-row.png)![account-id](static\/images\/pre-issuance-guide\/settings-network-passphrase-form.png)\r\n<\/span>\r\nOffline issuance application is available here:\r\n - [Windows](https:\/\/s3-eu-west-1.amazonaws.com\/881e65d1943e42\/pu\/TokenD+pre-issuance+tool-win32-x64.zip)\r\n - [macOSX](https:\/\/s3-eu-west-1.amazonaws.com\/881e65d1943e42\/pu\/TokenD+pre-issuance+tool-darwin-x64.zip)\r\n - [Source Code](https:\/\/github.com\/tokend\/offline-issuance)\r\n"
    }
  }
}
